/**
 ****************************************************************************************************
 * @file        iwdg.h
 * @version     V1.0
 * @brief       独立看门狗 驱动代码
 ****************************************************************************************************
 */	

#ifndef __IWDG_H
#define __IWDG_H

#ifdef __cplusplus
 extern "C" {
#endif


/* Includes ------------------------------------------------------------------*/

#include "sys.h"


/******************************************************************************************/

void fwdgt_init(uint8_t prer, uint16_t rlr); /* 初始化FWDGT，并使能FWDGT */
void fwdgt_feed(void);                       /* 喂独立看门狗 */ 

#ifdef __cplusplus
}
#endif

#endif
