/**
 ****************************************************************************************************
 * @file        timer.c
 * @version     V1.0
 * @brief       定时器中断 驱动代码
 ****************************************************************************************************
 * 实验平台:    GD32H737VMT6小系统板
 *
 ****************************************************************************************************
 */


#ifndef __TIMER_H
#define __TIMER_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/

#include "sys.h"

/******************************************************************************************/
/* 定时器 定义 */

/* TIMERX 中断定义 
 * 注意: 通过修改这4个宏定义,可以支持任意一个定时器.
 */
 
#define TIMERX_INT                       TIMER50
#define TIMERX_INT_IRQn                  TIMER50_IRQn
#define TIMERX_INT_IRQHandler            TIMER50_IRQHandler
#define TIMERX_INT_CLK                   RCU_TIMER50  /* TIMER50 时钟使能 */

/******************************************************************************************/

void timerx_int_init(uint64_t arr, uint16_t psc);     /* 定时器TIMERX 定时中断初始化函数 */

#ifdef __cplusplus
}
#endif

#endif